# 状態集合K
K = { 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 }

# 入力として受け付ける記号Σ
S = { 10, 50 }

# 現在の状態Q（初期状態q0=0）
Q = 0

# 状態遷移σ：(状態, 入力) -> 状態
D = { (0,10):10, (10,10):20, (20,10):30, (30,10):40, (40,10):50, (50,10):60,
      (0,50):50, (10,50):60, (20,50):70, (30,50):80, (40,50):90, (50,50):100 }

# 終了状態F
F = { 60, 70, 80, 90, 100 }


while not Q in F:
    try:
        i = int(input())
        if not i in S:
            raise ValueError
    except:
        print('入力として受け付けられない記号です')
        break
    Q = D[(Q, i)]

if Q in F:
    print('60円のジュースを出力')
    if Q != 60:
        print(Q-60, '円のおつり', sep='')
